#include <iostream>

using namespace std;

int main()
{
    cout << "Enter x value: "; 
    double x;
    cin >> x; //Вводимо значення х
    double y;

    if (x <= -1) //Перевірка x на відповідність першому проміжку.
        y = (1 / pow(x, 2)); //У разі відповідності визначаємо значення y за формулою для проміжку.
    else if (x >= -1 && x <= 2) //Перевірка x на відповідність другому проміжку.
        y = (pow(x, 2)); //У разі відповідності визначаємо значення y за формулою для проміжку.
    else
        y = 4; //Якщо y не належить першим двом проміжкам, то його значення є 4.
    cout << "Function value: " << y << endl;
}
